// pages/activity/activity.js
Page({
  data: {
    activityText: [{
      text: "从泥泞小路变成康庄大道，从竹篱茅舍变成高台广厦，从荒无人烟变成车水马龙。随着时间的推移，城市在飞速的变化。"
    }, {
      text: "唯一不变的是我们记忆中的家乡。当你出门在外，孤身一人在陌生的世界摸爬滚打时，你的家乡也悄悄地与你一同奋进。"
    }, {
      text: "你是否也有过这样的感觉，当你衣锦还乡，家门前的臭水沟早已变成湿地公园，学校门口的小树苗早已成为人们乘凉的好地方，而母亲脸上的笑，虽爬上了皱纹，却依然慈祥。"
    }, {
      text: "现在，拿起你的手机，用最特别的方式，记录下你记忆中家乡最不一样的变化，让照片带你乘坐时光机，飞回记忆最深处的地方！"
    }, {
      text: "点击上传图片（一个按钮）此次活动将通过由大众点赞投票评选出最优秀最有个性主题的照片，并按排名推选出一二三等奖。我们也为优秀的作品提供了丰富的奖励呦~"
    }],
    award: [{
      rank: "一等奖一名",
      award: "奖品：价值818元富士instax mini9拍立得相机",
      awardUrl: "../../images/more/jiangpin1.png"
    }, {
      rank: "二等奖三名",
      award: "奖品：价值499元蓝牙遥控一体式自拍杆",
      awardUrl: "../../images/more/jiangpin2.png"
    }, {
      rank: "三等奖十名",
      award: "奖品：价值39元定制陶瓷纪念马克杯一只",
      awardUrl: "../../images/more/jiangpin3.png"
    }]
  },

  onLoad: function(options) {

  },


})